# pandas

Series基礎

In [77]:
import pandas as pd

In [78]:
a=[1,2,3,4,5]
s=pd.Series(a)
print(s.index)
s.values

RangeIndex(start=0, stop=5, step=1)

array([1, 2, 3, 4, 5])

In [79]:
d={'name':['Alice','Bob','Charlie'],'weight':[20,30,40],'height':[130,140,150]}
df=pd.DataFrame(d,index=[1,3,5])
print(df['name'])
print(df.loc[1])

1      Alice
3        Bob
5    Charlie
Name: name, dtype: object
name      Alice
weight       20
height      130
Name: 1, dtype: object

In [80]:
print(df.iloc[1])
print(df.loc[1])
#ilocは行数(0base)、locはindex値

name      Bob
weight     30
height    140
Name: 3, dtype: object
name      Alice
weight       20
height      130
Name: 1, dtype: object

In [81]:
d={'name':['Alice','Bob','Charlie'],'weight':[20,30,40],'height':[130,140,150]}
df=pd.DataFrame(d)
df['BMI']=df['weight']/(df['height']/100)**2
df

      name  weight  height        BMI
0    Alice      20     130  11.834320
1      Bob      30     140  15.306122
2  Charlie      40     150  17.777778

In [82]:
df_over=df[df['BMI']>15]
len(df_over)

2

In [83]:
df.set_index('name')

         weight  height        BMI
name
Alice        20     130  11.834320
Bob          30     140  15.306122
Charlie      40     150  17.777778

In [84]:
df.reset_index(level=None, drop=True, inplace=False, col_level=0, col_fill='')

      name  weight  height        BMI
0    Alice      20     130  11.834320
1      Bob      30     140  15.306122
2  Charlie      40     150  17.777778

In [85]:
d2={'name':['Dnaiel','Eric','Ford'],'weight':[60,50,40],'height':[151,154,156]}
df2=pd.DataFrame(d2)
df2

     name  weight  height
0  Dnaiel      60     151
1    Eric      50     154
2    Ford      40     156

In [86]:
df_c=pd.concat([df,df2],ignore_index=True)
df_c

      name  weight  height        BMI
0    Alice      20     130  11.834320
1      Bob      30     140  15.306122
2  Charlie      40     150  17.777778
3   Dnaiel      60     151        NaN
4     Eric      50     154        NaN
5     Ford      40     156        NaN

In [87]:
d3={'name':['Alice','Eric'],'city':['Tokyo','Nagoya']}
df3=pd.DataFrame(d3)
print(df3)
df_m1=pd.merge(df_c,df3,on='name',how='left')
df_m1

    name    city
0  Alice   Tokyo
1   Eric  Nagoya

      name  weight  height        BMI    city
0    Alice      20     130  11.834320   Tokyo
1      Bob      30     140  15.306122     NaN
2  Charlie      40     150  17.777778     NaN
3   Dnaiel      60     151        NaN     NaN
4     Eric      50     154        NaN  Nagoya
5     Ford      40     156        NaN     NaN

In [88]:
df_items = pd.DataFrame({
    'item_id': [101, 102, 103, 104],
    'item_name': ['りんご', 'バナナ', '牛乳', 'パン'],
    'category_id': [1, 1, 2, 3]
})
df_category = pd.DataFrame({
    'category_id': [1, 2, 3],
    'category_name': ['果物', '飲料', 'パン類']
})

df_merged = pd.merge(df_items, df_category, on='category_id', how='left')

df_merged

   item_id item_name  category_id category_name
0      101       りんご            1            果物
1      102       バナナ            1            果物
2      103        牛乳            2            飲料
3      104        パン            3           パン類

In [89]:
df_a = pd.DataFrame({
    'customer': ['Alice', 'Bob', 'Alice'],
    'product': ['Apple', 'Banana', 'Banana']
})

df_b = pd.DataFrame({
    'product': ['Apple', 'Banana', 'Banana'],
    'category': ['Fruit', 'Fruit', 'Snack']
})

df_joined = pd.merge(df_a, df_b, on='product', how='inner')

df_joined

  customer product category
0    Alice   Apple    Fruit
1      Bob  Banana    Fruit
2      Bob  Banana    Snack
3    Alice  Banana    Fruit
4    Alice  Banana    Snack

In [90]:
print(df_m1.isna())
print(df_m1.notna())

    name  weight  height    BMI   city
0  False   False   False  False  False
1  False   False   False  False   True
2  False   False   False  False   True
3  False   False   False   True   True
4  False   False   False   True  False
5  False   False   False   True   True
   name  weight  height    BMI   city
0  True    True    True   True   True
1  True    True    True   True  False
2  True    True    True   True  False
3  True    True    True  False  False
4  True    True    True  False   True
5  True    True    True  False  False

In [91]:
df_fill_median = df_m1.copy()
df_fill_median['BMI'] = df_fill_median['BMI'].fillna(df_fill_median['BMI'].median())
df_fill_median

      name  weight  height        BMI    city
0    Alice      20     130  11.834320   Tokyo
1      Bob      30     140  15.306122     NaN
2  Charlie      40     150  17.777778     NaN
3   Dnaiel      60     151  15.306122     NaN
4     Eric      50     154  15.306122  Nagoya
5     Ford      40     156  15.306122     NaN

In [92]:
df_fill_ffill = df_m1.copy()
df_fill_ffill['BMI'] = df_fill_ffill['BMI'].fillna(df_fill_ffill['BMI'].ffill())
df_fill_ffill

      name  weight  height        BMI    city
0    Alice      20     130  11.834320   Tokyo
1      Bob      30     140  15.306122     NaN
2  Charlie      40     150  17.777778     NaN
3   Dnaiel      60     151  17.777778     NaN
4     Eric      50     154  17.777778  Nagoya
5     Ford      40     156  17.777778     NaN

In [96]:
import numpy as np

data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'),
dtype='Int64')
data

a       1
b    <NA>
c       2
d    <NA>
e       3
dtype: Int64

階層的インデックス

In [97]:
index = [('California', 2010), ('California', 2020),
('New York', 2010), ('New York', 2020),
('Texas', 2010), ('Texas', 2020)]

populations = [37253956, 39538223,
19378102, 20201249,
25145561, 29145505]
pop = pd.Series(populations, index=index)
pop

(California, 2010)    37253956
(California, 2020)    39538223
(New York, 2010)      19378102
(New York, 2020)      20201249
(Texas, 2010)         25145561
(Texas, 2020)         29145505
dtype: int64

In [100]:
index = pd.MultiIndex.from_tuples(index)
pop = pop.reindex(index)
pop

California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [101]:
pop[:, 2020]

California    39538223
New York      20201249
Texas         29145505
dtype: int64

In [102]:
pop_df = pop.unstack()
pop_df

                2010      2020
California  37253956  39538223
New York    19378102  20201249
Texas       25145561  29145505

In [104]:
pop2=pop_df.stack()
pop2

California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [105]:
pop_df = pd.DataFrame({'total': pop,
'under18': [9284094, 8898092,
4318033, 4181528,
6879014, 7432474]})
pop_df

                    total  under18
California 2010  37253956  9284094
           2020  39538223  8898092
New York   2010  19378102  4318033
           2020  20201249  4181528
Texas      2010  25145561  6879014
           2020  29145505  7432474

In [107]:
import numpy as np
import pandas as pd
class Display:
    """HTML表現で複数オブジェクトを表示する"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}{1}
    """
    def __init__(self, *args):
        self.args = args
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
            for a in self.args)
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
            for a in self.args)

In [108]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [109]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [110]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [111]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [115]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [116]:
planets.groupby('method')

In [119]:
planets.groupby('method')['orbital_period'].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [120]:
for (method, group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

In [121]:
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.0
       Eclipse Timing Variations           9.0
       Imaging                            38.0
       Microlensing                       23.0
       Orbital Brightness Modulation       3.0
                                         ...
max    Pulsar Timing                    2011.0
       Pulsation Timing Variations      2007.0
       Radial Velocity                  2014.0
       Transit                          2014.0
       Transit Timing Variations        2014.0
Length: 80, dtype: float64

In [122]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data1': range(6),
'data2': rng.randint(0, 10, 6)},
columns=['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [124]:
df.groupby('key').aggregate(['min','median','max'])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [125]:
df.groupby('key').aggregate([min,np.median,max])

C:\Users\katet\AppData\Local\Temp\ipykernel_23972\2943854441.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.groupby('key').aggregate([min,np.median,max])
C:\Users\katet\AppData\Local\Temp\ipykernel_23972\2943854441.py:1: FutureWarning: The provided callable <function median at 0x0000027ACFF2DD00> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby('key').aggregate([min,np.median,max])
C:\Users\katet\AppData\Local\Temp\ipykernel_23972\2943854441.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby('key').aggregate([min,np.median,max])
C:\Users\katet\AppData\Local\Temp\ipykernel_23972\2943854441.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.groupby('key').aggregate([min,np.median,max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [126]:
df.groupby('key').aggregate({'data1': 'min',
'data2': 'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [127]:
def filter_func(x):
    return x['data2'].std() > 4
Display('df', "df.groupby('key').std()",
"df.groupby('key').filter(filter_func)")

df
  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

df.groupby('key').std()
       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641

df.groupby('key').filter(filter_func)
  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [128]:
def center(x):
    return x - x.mean()
df.groupby('key').transform(center)

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [129]:
def norm_by_data2(x):
    # xはgroupごとDataFrameオブジェクト
    x['data1'] /= x['data2'].sum()
    return x
df.groupby('key').apply(norm_by_data2)

C:\Users\katet\AppData\Local\Temp\ipykernel_23972\3676087149.py:5: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby('key').apply(norm_by_data2)

      key     data1  data2
key
A   0   A  0.000000      5
    3   A  0.375000      3
B   1   B  0.142857      0
    4   B  0.571429      7
C   2   C  0.166667      3
    5   C  0.416667      9

In [130]:
decade = 10 * (planets['year'] // 10)
decade = decade.astype(str) + 's'
decade.name = 'decade'
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

In [131]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [132]:
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [135]:
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()

C:\Users\katet\AppData\Local\Temp\ipykernel_23972\2603839867.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [136]:
titanic.pivot_table('survived', index='sex', columns='class', aggfunc='mean')

C:\Users\katet\AppData\Local\Temp\ipykernel_23972\619644514.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table('survived', index='sex', columns='class', aggfunc='mean')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [137]:
age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

C:\Users\katet\AppData\Local\Temp\ipykernel_23972\3418781527.py:2: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table('survived', ['sex', age], 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [138]:
import urllib.request
file_path='https://raw.githubusercontent.com/jakevdp/data-CDCbirths/master/births.csv'
file_name='birth.csv'
urllib.request.urlretrieve(file_path,file_name)

('birth.csv', <http.client.HTTPMessage at 0x27ad71eda60>)

これは後でやる。まだやらない

文字列操作

In [146]:
data = ['peter ', ' Paul', 'MAR Y', 'gU IDO']
names=pd.Series(data)
names.str.upper()
names.str.strip().str.replace(' ','').str.capitalize()

0    Peter
1     Paul
2     Mary
3    Guido
dtype: object

In [147]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
'Eric Idle', 'Terry Jones', 'Michael Palin'])

In [148]:
monte.str.extract('([A-Za-z]+)', expand=False)

0     Graham
1       John
2      Terry
3       Eric
4      Terry
5    Michael
dtype: object

In [149]:
from dateutil import parser
date = parser.parse("2021年8月11日")
date

ParserError: Unknown string format: 2021年8月11日

In [151]:
import numpy as np
date = np.array('2021-07-04', dtype=np.datetime64)
date+ np.arange(62)

array(['2021-07-04', '2021-07-05', '2021-07-06', '2021-07-07',
       '2021-07-08', '2021-07-09', '2021-07-10', '2021-07-11',
       '2021-07-12', '2021-07-13', '2021-07-14', '2021-07-15',
       '2021-07-16', '2021-07-17', '2021-07-18', '2021-07-19',
       '2021-07-20', '2021-07-21', '2021-07-22', '2021-07-23',
       '2021-07-24', '2021-07-25', '2021-07-26', '2021-07-27',
       '2021-07-28', '2021-07-29', '2021-07-30', '2021-07-31',
       '2021-08-01', '2021-08-02', '2021-08-03', '2021-08-04',
       '2021-08-05', '2021-08-06', '2021-08-07', '2021-08-08',
       '2021-08-09', '2021-08-10', '2021-08-11', '2021-08-12',
       '2021-08-13', '2021-08-14', '2021-08-15', '2021-08-16',
       '2021-08-17', '2021-08-18', '2021-08-19', '2021-08-20',
       '2021-08-21', '2021-08-22', '2021-08-23', '2021-08-24',
       '2021-08-25', '2021-08-26', '2021-08-27', '2021-08-28',
       '2021-08-29', '2021-08-30', '2021-08-31', '2021-09-01',
       '2021-09-02', '2021-09-03'], dtype='datetime64[D]')

In [156]:
index=pd.DatetimeIndex(date + pd.to_timedelta(np.arange(365), 'D'))
index

DatetimeIndex(['2021-07-04', '2021-07-05', '2021-07-06', '2021-07-07',
               '2021-07-08', '2021-07-09', '2021-07-10', '2021-07-11',
               '2021-07-12', '2021-07-13',
               ...
               '2022-06-24', '2022-06-25', '2022-06-26', '2022-06-27',
               '2022-06-28', '2022-06-29', '2022-06-30', '2022-07-01',
               '2022-07-02', '2022-07-03'],
              dtype='datetime64[ns]', length=365, freq=None)

In [161]:
df=pd.DataFrame(range(len(index)),index=index)
df['2021-07':'2021-08-15']

             0
2021-07-04   0
2021-07-05   1
2021-07-06   2
2021-07-07   3
2021-07-08   4
2021-07-09   5
2021-07-10   6
2021-07-11   7
2021-07-12   8
2021-07-13   9
2021-07-14  10
2021-07-15  11
2021-07-16  12
2021-07-17  13
2021-07-18  14
2021-07-19  15
2021-07-20  16
2021-07-21  17
2021-07-22  18
2021-07-23  19
2021-07-24  20
2021-07-25  21
2021-07-26  22
2021-07-27  23
2021-07-28  24
2021-07-29  25
2021-07-30  26
2021-07-31  27
2021-08-01  28
2021-08-02  29
2021-08-03  30
2021-08-04  31
2021-08-05  32
2021-08-06  33
2021-08-07  34
2021-08-08  35
2021-08-09  36
2021-08-10  37
2021-08-11  38
2021-08-12  39
2021-08-13  40
2021-08-14  41
2021-08-15  42

ここまでB060